Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/migrant_workers/employment_permits/work_permits.html.txt.tmx
Source language: en
Languages: ga

source: • Are in the State illegally or you no longer comply with the conditions under which you were admitted
ga: • Tá tú sa Stát go mídhleathach nó ní chomhlíonann tú na coinníollacha a thuilleadh faoinar tugadh cead isteach duit

source: • Have been asked by the Department of Justice and Equality to leave the State
ga: • D’iarr an Roinn Dlí agus Cirt agus Comhionannais ort an Stát a fhágáil

source: • Are in the process of being deported
ga: • Tá tú á dhíbirt faoi láthair

source: • Are seeking employment with a non-European Economic Area/Swiss employer who is operating in the State without business permission from the Minister for Justice and Equality
ga: • Tá fostaíocht á lorg agat le fostóir neamh-Limistéar Eorpach Eacnamaíoch/Éilvéiseach atá ag oibriú sa Stát gan cead gnó ón Aire Dlí agus Cirt agus Comhionannas

source: The fee must be paid by the applicant
ga: Ní mór don iarratasóir an táille a íoc

source: Either the employee or the employer can apply
ga: Féadfaidh an fostaí nó an fostóir iarratas a dhéanamh

source: In some circumstances, for example, where the employer applying is a registered charity, the fee may be waived
ga: Faoi roinnt cúinsí, mar shampla, sa chás gur carthanas cláraithe é an fostóir a bhfuil iarratas á dhéanamh aige/aici, féadtar an táille a tharscaoileadh

source: Payments from businesses are made by electronic fund transfer (EFT)
ga: Déantar íocaíochtaí ó gnóthaí trí ríomhaistriú airgid (EFT)

source: Fees for new applications for General Employment Permits
ga: Táillí ar iarratais nua ar Cheadanna Fostaíochta Ginearálta

source: │Duration of permit │Amount │
ga: │Fad an cheada │Méid │

source: │Up to 6 months │€500 │
ga: │A fhad le 6 mhí │€500 │

source: │Up to 2 years │€1,000 │
ga: │A fhad le 2 bhliain │€1,000 │

source: Fees for renewals of General Employment Permits
ga: Táillí ar athnuachan ar Cheadanna

source: │Duration of renewal │Amount │
ga: │Fad na hathnuachana │Méid │

source: │Up to 6 months │€750 │
ga: │A fhad le 6 mhí │€750 │

source: │Up to 3 years │€1,500 │
ga: │A fhad le 3 bliana │€1,500 │

source: If an application is refused or withdrawn, 90% of the fee will be refunded to the applicant
ga: Má dhiúltaítear nó má aistarraingítear iarratas, aisíocfar 90% den táille leis an iarratasóir

source: The fee for the Certificate of Registration is €300
ga: Is í an táille atá ar Dheimhniú Clárúcháin BNIGS ná €300

source: New applications for General Employment Permits can be made by the prospective employer or employee to the Employment Permits Section of the Department of Jobs, Enterprise and Innovation
ga: Féadfaidh an fostóir ionchasach no an fostaí iarratais nua a dhéanamh ar Cheadanna Fostaíochta Ginearálta leis an Rannóg Ceadanna Fostaíochta den Roinn Post, Fiontar agus Nuálaíochta

source: Since 5 September 2016, you apply online with the required documentation, using the Employment Permits Online System (EPOS)
ga: Ó 5 Meán Fómhair 2016, féadtar iarratais a dhéanamh ar líne leis an cháipéisíocht tacaíochta a theastaíonn agus leas á bhaint as an gCóras Ceadanna Fostaíochta Ar Líne (CCFA)

source: Processing and reviews: You can check the status of your application through the online status enquiry facility
ga: Próiseáil agus athbhreithnithe: Féadfaidh tú stádas d’iarratas tríd an tsaoráid fhiosrúcháin faoi stádas ar líne a sheiceáil

source: The application processing times on the Department’s website
ga: Tá na hamanna próiseála iarratais ar shuíomh gréasáin na Roinne

source: The official processing your application will either grant it or refuse it for specific reasons
ga: Déanfaidh próiseáil oifigiúil d’iarratais é a dheonú nó a dhiúltú ar údair shonracha

source: If your application is refused you may appeal the decision within 28 days, using the form to submit a decision for review
ga: Má dhiúltaítear d’iarratas, féadfaidh tú achomharc a dhéanamh laistigh de 28 lá, trí leas a bhaint as an bhfoirm chun cinneadh a sheoladh isteach a bhfuil athbhreithniú le déanamh air

source: Renewal of General Employment Permits: Either an employer or an employee can apply for a renewal using the Employment Permits Online System (EPOS) 16 weeks before the expiry of the permit
ga: Athnuachan ar Cheadanna Fostaíochta Ginearálta: Féadfaidh an fostóir nó an fostaí iarratas a dhéanamh ar athnuachan agus leas á bhaint as an gCóras Ceadanna Fostaíochta Ar Líne (CCFA)

source: If an employer applies for a General Employment Permit for a former employee who has left the State, this will be considered a new application
ga: Má dhéanann fostóir iarratas ar Chead Fostaíochta Ginearálta d’iar-fhostaí a d’fhág an Stát, measfar gurb iarratas nua seo

source: There is further information about General Employment Permits on the Department's website. Where to apply
ga: Tá breis faisnéise ar fáil faoi Cheadanna Fostaíochta Ginearálta ar láithreán gréasáin na Roinne
